{"format": "graph-model", "generatedBy": "2.1.0", "convertedBy": "TensorFlow.js Converter v1.7.2", "userDefinedMetadata": {"signature": {"inputs": {"input_1:0": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "36"}, {"size": "60"}, {"size": "1"}]}}}, "outputs": {"Identity_1:0": {"name": "Identity_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "6"}]}}, "Identity_2:0": {"name": "Identity_2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "36"}, {"size": "60"}, {"size": "1"}]}}, "Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}]}}}}}, "modelTopology": {"node": [{"name": "input_1", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "36"}, {"size": "60"}, {"size": "1"}]}}}}, {"name": "Func/StatefulPartitionedCall/input/_6", "op": "Const", "input": ["^input_1"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "880"}, {"size": "6"}, {"size": "16"}, {"size": "8"}]}}}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/ExpandDims_1/dim", "op": "Const", "input": ["^input_1"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/Tile/multiples", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/add_1/y", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/reshape/Reshape/shape/2", "op": "Const", "input": ["^input_1"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/zeros/packed/1", "op": "Const", "input": ["^input_1"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Tile/multiples", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/concat", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Sum_1/reduction_indices", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/Reshape/shape", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Const_1", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/zeros/packed/2", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/add_9/x", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Const", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/margin/Sum/reduction_indices", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/capsule_network/flatten_1/Const", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/strided_slice/stack", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/strided_slice/stack_1", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/capsule_network/reconstruction/Reshape/shape/1", "op": "Const", "input": ["^input_1"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/capsule_network/reconstruction/Reshape/shape/2", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Sum/reduction_indices", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/capsule_network/conv2d/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/conv2d/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "9"}, {"size": "9"}, {"size": "1"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/capsule_network/gaze/MatMul/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/conv2d_1/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/conv2d_1/Conv2D/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "9"}, {"size": "9"}, {"size": "256"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/dense/MatMul/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/dense_1/MatMul/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/dense_2/MatMul/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}, {"size": "2160"}]}}}}}, {"name": "StatefulPartitionedCall/capsule_network/dense_3/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/dense_3/MatMul/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/dense_4/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/dense_4/MatMul/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/gaze/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/conv2d/Relu", "op": "_FusedConv2D", "input": ["input_1", "StatefulPartitionedCall/capsule_network/conv2d/Conv2D/ReadVariableOp", "StatefulPartitionedCall/capsule_network/conv2d/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "Func/StatefulPartitionedCall/output_control_node/_22", "op": "NoOp", "input": ["^StatefulPartitionedCall/capsule_network/conv2d/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/capsule_network/conv2d/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/capsule_network/conv2d_1/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/capsule_network/conv2d_1/Conv2D/ReadVariableOp", "^StatefulPartitionedCall/capsule_network/dense/MatMul/ReadVariableOp", "^StatefulPartitionedCall/capsule_network/dense_1/MatMul/ReadVariableOp", "^StatefulPartitionedCall/capsule_network/dense_2/MatMul/ReadVariableOp", "^StatefulPartitionedCall/capsule_network/dense_3/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/capsule_network/dense_3/MatMul/ReadVariableOp", "^StatefulPartitionedCall/capsule_network/dense_4/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/capsule_network/dense_4/MatMul/ReadVariableOp", "^StatefulPartitionedCall/capsule_network/gaze/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/capsule_network/gaze/MatMul/ReadVariableOp"]}, {"name": "StatefulPartitionedCall/capsule_network/conv2d_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/capsule_network/conv2d/Relu", "StatefulPartitionedCall/capsule_network/conv2d_1/Conv2D/ReadVariableOp", "StatefulPartitionedCall/capsule_network/conv2d_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/capsule_network/reshape/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/capsule_network/conv2d_1/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/capsule_network/reshape/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/capsule_network/reshape/Shape", "StatefulPartitionedCall/capsule_network/digit_caps/strided_slice/stack", "StatefulPartitionedCall/capsule_network/digit_caps/strided_slice/stack_1", "StatefulPartitionedCall/capsule_network/digit_caps/strided_slice/stack_1"], "attr": {"shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/capsule_network/reshape/Reshape/shape", "op": "Pack", "input": ["StatefulPartitionedCall/capsule_network/reshape/strided_slice", "StatefulPartitionedCall/capsule_network/digit_caps/zeros/packed/1", "StatefulPartitionedCall/capsule_network/reshape/Reshape/shape/2"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "3"}}}, {"name": "StatefulPartitionedCall/capsule_network/reshape/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/capsule_network/conv2d_1/Relu", "StatefulPartitionedCall/capsule_network/reshape/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/capsule_network/lambda/Square", "op": "Square", "input": ["StatefulPartitionedCall/capsule_network/reshape/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/lambda/Sum", "op": "Sum", "input": ["StatefulPartitionedCall/capsule_network/lambda/Square", "StatefulPartitionedCall/capsule_network/margin/Sum/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/lambda/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/add_1/y", "StatefulPartitionedCall/capsule_network/lambda/Sum"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/lambda/add", "op": "AddV2", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/add_9/x", "StatefulPartitionedCall/capsule_network/lambda/Sum"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/lambda/clip_by_value/Minimum", "op": "Minimum", "input": ["StatefulPartitionedCall/capsule_network/lambda/add_1", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Const_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/lambda/truediv", "op": "RealDiv", "input": ["StatefulPartitionedCall/capsule_network/lambda/Sum", "StatefulPartitionedCall/capsule_network/lambda/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/lambda/clip_by_value", "op": "Maximum", "input": ["StatefulPartitionedCall/capsule_network/lambda/clip_by_value/Minimum", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Const"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/lambda/Sqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/capsule_network/lambda/clip_by_value"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/lambda/truediv_1", "op": "Mul", "input": ["StatefulPartitionedCall/capsule_network/lambda/Sqrt", "StatefulPartitionedCall/capsule_network/lambda/truediv"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/lambda/mul", "op": "Mul", "input": ["StatefulPartitionedCall/capsule_network/lambda/truediv_1", "StatefulPartitionedCall/capsule_network/reshape/Reshape"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/capsule_network/lambda/mul", "StatefulPartitionedCall/capsule_network/margin/Sum/reduction_indices"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/capsule_network/lambda/mul"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/ExpandDims_1", "op": "ExpandDims", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/ExpandDims", "StatefulPartitionedCall/capsule_network/digit_caps/ExpandDims_1/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/Shape", "StatefulPartitionedCall/capsule_network/digit_caps/strided_slice/stack", "StatefulPartitionedCall/capsule_network/digit_caps/strided_slice/stack_1", "StatefulPartitionedCall/capsule_network/digit_caps/strided_slice/stack_1"], "attr": {"ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/Tile", "op": "Tile", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/ExpandDims_1", "StatefulPartitionedCall/capsule_network/digit_caps/Tile/multiples"], "attr": {"Tmultiples": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/Tile_1/multiples", "op": "Pack", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/strided_slice", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Sum/reduction_indices", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Sum/reduction_indices", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Sum/reduction_indices", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Sum/reduction_indices"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "5"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/strided_slice", "StatefulPartitionedCall/capsule_network/digit_caps/zeros/packed/1", "StatefulPartitionedCall/capsule_network/digit_caps/zeros/packed/2", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Sum/reduction_indices", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Sum/reduction_indices"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "5"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/Tile_1", "op": "Tile", "input": ["Func/StatefulPartitionedCall/input/_6", "StatefulPartitionedCall/capsule_network/digit_caps/Tile_1/multiples"], "attr": {"Tmultiples": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/zeros/packed", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/MatMul", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/Tile_1", "StatefulPartitionedCall/capsule_network/digit_caps/Tile"], "attr": {"adj_x": {"b": false}, "adj_y": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/zeros", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/concat"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/transpose"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Softmax", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/concat"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/MatMul", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/transpose_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Sum", "op": "Sum", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Mul", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Sum/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Square", "op": "Square", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Sum"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Sum_1", "op": "Sum", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Square", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Sum_1/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Sum_1", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/add_1/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/add", "op": "AddV2", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Sum_1", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/add_9/x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/clip_by_value/Minimum", "op": "Minimum", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/add_1", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Const_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/truediv", "op": "RealDiv", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Sum_1", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/clip_by_value", "op": "Maximum", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/clip_by_value/Minimum", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Const"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Sqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/clip_by_value"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/truediv_1", "op": "Mul", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Sqrt", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/truediv"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Sum", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/truediv_1"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Tile", "op": "Tile", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/mul_1", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Tile/multiples"], "attr": {"Tmultiples": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/MatMul", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/MatMul", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Tile"], "attr": {"adj_x": {"b": true}, "adj_y": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Add_2", "op": "Add", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/MatMul", "StatefulPartitionedCall/capsule_network/digit_caps/zeros"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/transpose_2", "op": "Transpose", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Add_2", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/concat"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Softmax_1", "op": "Softmax", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/transpose_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/transpose_3", "op": "Transpose", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Softmax_1", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/concat"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/MatMul", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/transpose_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Sum_2", "op": "Sum", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Mul_2", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Sum/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Square_1", "op": "Square", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Sum_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Sum_3", "op": "Sum", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Square_1", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Sum_1/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/add_4", "op": "AddV2", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Sum_3", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/add_1/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/add_3", "op": "AddV2", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Sum_3", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/add_9/x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/clip_by_value_1/Minimum", "op": "Minimum", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/add_4", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Const_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/truediv_2", "op": "RealDiv", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Sum_3", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/add_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/clip_by_value_1", "op": "Maximum", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/clip_by_value_1/Minimum", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Const"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Sqrt_1", "op": "Rsqrt", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/clip_by_value_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/truediv_3", "op": "Mul", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Sqrt_1", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/truediv_2"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/mul_3", "op": "Mul", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Sum_2", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/truediv_3"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Tile_1", "op": "Tile", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/mul_3", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Tile/multiples"], "attr": {"Tmultiples": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/MatMul_1", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/MatMul", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Tile_1"], "attr": {"adj_x": {"b": true}, "adj_y": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Add_5", "op": "Add", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Add_2", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/MatMul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/transpose_4", "op": "Transpose", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Add_5", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/concat"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Softmax_2", "op": "Softmax", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/transpose_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/transpose_5", "op": "Transpose", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Softmax_2", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/concat"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Mul_4", "op": "Mul", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/MatMul", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/transpose_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Sum_4", "op": "Sum", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Mul_4", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Sum/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Square_2", "op": "Square", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Sum_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Sum_5", "op": "Sum", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Square_2", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Sum_1/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/add_7", "op": "AddV2", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Sum_5", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/add_1/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/add_6", "op": "AddV2", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Sum_5", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/add_9/x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/clip_by_value_2/Minimum", "op": "Minimum", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/add_7", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Const_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/truediv_4", "op": "RealDiv", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Sum_5", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/add_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/clip_by_value_2", "op": "Maximum", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/clip_by_value_2/Minimum", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Const"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Sqrt_2", "op": "Rsqrt", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/clip_by_value_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/truediv_5", "op": "Mul", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Sqrt_2", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/truediv_4"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/mul_5", "op": "Mul", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Sum_4", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/truediv_5"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Tile_2", "op": "Tile", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/mul_5", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Tile/multiples"], "attr": {"Tmultiples": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/MatMul_2", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/MatMul", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Tile_2"], "attr": {"adj_x": {"b": true}, "adj_y": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Add_8", "op": "Add", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Add_5", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/MatMul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/transpose_6", "op": "Transpose", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Add_8", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/concat"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Softmax_3", "op": "Softmax", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/transpose_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/transpose_7", "op": "Transpose", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Softmax_3", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/concat"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Mul_6", "op": "Mul", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/MatMul", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/transpose_7"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Sum_6", "op": "Sum", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Mul_6", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Sum/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Square_3", "op": "Square", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Sum_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Sum_7", "op": "Sum", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Square_3", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Sum_1/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/add_10", "op": "AddV2", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Sum_7", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/add_1/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/add_9", "op": "AddV2", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Sum_7", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/add_9/x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/clip_by_value_3/Minimum", "op": "Minimum", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/add_10", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Const_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/truediv_6", "op": "RealDiv", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Sum_7", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/add_9"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/clip_by_value_3", "op": "Maximum", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/clip_by_value_3/Minimum", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Const"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Sqrt_3", "op": "Rsqrt", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/clip_by_value_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/truediv_7", "op": "Mul", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Sqrt_3", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/truediv_6"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/mul_7", "op": "Mul", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Sum_6", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/truediv_7"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/digit_caps/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/mul_7", "StatefulPartitionedCall/capsule_network/digit_caps/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/capsule_network/margin/Square", "op": "Square", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/margin/Sum", "op": "Sum", "input": ["StatefulPartitionedCall/capsule_network/margin/Square", "StatefulPartitionedCall/capsule_network/margin/Sum/reduction_indices"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/margin/add", "op": "AddV2", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/add_1/y", "StatefulPartitionedCall/capsule_network/margin/Sum"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/margin/clip_by_value/Minimum", "op": "Minimum", "input": ["StatefulPartitionedCall/capsule_network/margin/add", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Const_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/margin/clip_by_value", "op": "Maximum", "input": ["StatefulPartitionedCall/capsule_network/margin/clip_by_value/Minimum", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Const"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/margin/Sqrt", "op": "Sqrt", "input": ["StatefulPartitionedCall/capsule_network/margin/clip_by_value"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/mask/ArgMax", "op": "ArgMax", "input": ["StatefulPartitionedCall/capsule_network/margin/Sqrt", "StatefulPartitionedCall/capsule_network/margin/Sum/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "output_type": {"type": "DT_INT64"}}}, {"name": "Identity_1", "op": "Identity", "input": ["StatefulPartitionedCall/capsule_network/margin/Sqrt", "^Func/StatefulPartitionedCall/output_control_node/_22"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/mask/one_hot", "op": "OneHot", "input": ["StatefulPartitionedCall/capsule_network/mask/ArgMax", "StatefulPartitionedCall/capsule_network/digit_caps/zeros/packed/2", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/add_9/x", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "axis": {"i": "-1"}, "TI": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/capsule_network/mask/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/capsule_network/mask/one_hot", "StatefulPartitionedCall/capsule_network/margin/Sum/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/capsule_network/mask/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/capsule_network/digit_caps/Reshape", "StatefulPartitionedCall/capsule_network/mask/ExpandDims"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/flatten_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/capsule_network/mask/Mul", "StatefulPartitionedCall/capsule_network/flatten_1/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/capsule_network/dense/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/capsule_network/flatten_1/Reshape", "StatefulPartitionedCall/capsule_network/dense/MatMul/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/capsule_network/dense_3/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/capsule_network/flatten_1/Reshape", "StatefulPartitionedCall/capsule_network/dense_3/MatMul/ReadVariableOp", "StatefulPartitionedCall/capsule_network/dense_3/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/capsule_network/dense/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/capsule_network/dense/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/dense_4/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/capsule_network/dense_3/BiasAdd", "StatefulPartitionedCall/capsule_network/dense_4/MatMul/ReadVariableOp", "StatefulPartitionedCall/capsule_network/dense_4/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/capsule_network/dense_1/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/capsule_network/dense/Relu", "StatefulPartitionedCall/capsule_network/dense_1/MatMul/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/capsule_network/gaze/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/capsule_network/dense_4/BiasAdd", "StatefulPartitionedCall/capsule_network/gaze/MatMul/ReadVariableOp", "StatefulPartitionedCall/capsule_network/gaze/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/capsule_network/dense_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/capsule_network/dense_1/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/capsule_network/gaze/BiasAdd", "^Func/StatefulPartitionedCall/output_control_node/_22"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/dense_2/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/capsule_network/dense_1/Relu", "StatefulPartitionedCall/capsule_network/dense_2/MatMul/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/capsule_network/dense_2/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/capsule_network/dense_2/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/reconstruction/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/capsule_network/dense_2/Sigmoid"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/capsule_network/reconstruction/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/capsule_network/reconstruction/Shape", "StatefulPartitionedCall/capsule_network/digit_caps/strided_slice/stack", "StatefulPartitionedCall/capsule_network/digit_caps/strided_slice/stack_1", "StatefulPartitionedCall/capsule_network/digit_caps/strided_slice/stack_1"], "attr": {"shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/capsule_network/reconstruction/Reshape/shape", "op": "Pack", "input": ["StatefulPartitionedCall/capsule_network/reconstruction/strided_slice", "StatefulPartitionedCall/capsule_network/reconstruction/Reshape/shape/1", "StatefulPartitionedCall/capsule_network/reconstruction/Reshape/shape/2", "StatefulPartitionedCall/capsule_network/digit_caps/PartitionedCall/Sum/reduction_indices"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/capsule_network/reconstruction/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/capsule_network/dense_2/Sigmoid", 